// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.

//                  [0;1) * 6 = [0,6) - проміжок від 0 до 6 (не включно);
// let arr = [Math.floor(Math.random()*6),
//     Math.floor(Math.random()*6),
//     Math.floor(Math.random()*6),
//     Math.floor(Math.random()*6),
//     Math.floor(Math.random()*6),
//     Math.floor(Math.random()*6),
//     Math.floor(Math.random()*6),
//     Math.floor(Math.random()*6),
//     Math.floor(Math.random()*6),
//     Math.floor(Math.random()*6)];
// console.log(arr);
// let result = arr[0]+arr[1]+arr[2]+arr[3]+arr[4]+arr[5]+arr[6]+arr[7]+arr[8]+arr[9];
// console.log(result);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр

// let book = {
//     name:'Пригоди Тома Соєра',
//     pages: 275,
//     genre:'Роман'
// }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори

// let book = {
//     name:'Собака Баскервілів',
//     pages: 319,
//     genre:'Роман',
//     authors:{
//         author:'Артур Конан Дойл'
//     }
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт

// let book1 = {
//     name:'Попелюшка',
//     pages: 72,
//     genre:'Казка',
//     author:'Шарль Перро'
// }
// let book2 = {
//     name:'Дюймовочка',
//     pages: 48,
//     genre:'Казка',
//     author:'Ганс Крістіан Андерсен'
// }
// let book3 = {
//     name:'Снігова королева',
//     pages: 70,
//     genre:'Казка',
//     author:'Ганс Крістіан Андерсен'
// }
// let book4 = {
//     name:'Вінні-Пух',
//     pages: 160,
//     genre:'Казка',
//     author:'Алан Александер Мілн'
// }
// let books = [book1,book2,book3,book4];
// console.log(books[0]);
// console.log(books[1]);
// console.log(books[2]);
// console.log(books[3]);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.

// let height = 23,width= 10;
// let s = height * width;
// console.log(`Площа прямокутника дорівнює ${s} см2`);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.

// let v,heightC = 10,dC = 4;
// const pi = 3.14;
// v = (pi*((dC / 2)**2)*heightC).toFixed(2);
// console.log(`Об'єм циліндра дорівнює ${+v} м3`);

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).

// let k,n=3,m=4;
// k = Math.sqrt(Math.pow(n,2) + Math.pow(m,2));
// console.log(k)

