// --створити масив з:
// - з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

// let arrNum = [25, 100, 225, 400, 625];
// let arrStr = ['one', 'two', 'three', 'four', 'five'];
// let arr = [100, 'one', 'two', true, false];
// for (let number of arrNum) {
//     console.log(number);
// }
// for (let string of arrStr) {
//     console.log(string);
// }
// for (let arrElement of arr) {
//     console.log(arrElement);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// let arr = [];
// for (let i = 0; i < 5; i++) {
//     switch (i){
//         case 0: arr[i] = 'one';
//             break;
//         case 1:arr[i] = 'two';
//             break;
//         case 2:arr[i] = 'three';
//             break;
//         case 3:arr[i] = 4;
//             break;
//         case 4:arr[i] = 5;
//             break;
//     }
//     console.log(arr[i]);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині

// for (let i = 0; i < 10; i++) {
//     document.write(`<div>Довільний текст</div>`);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині

// for (let i = 0; i < 10; i++) {
//     document.write(`<div>Довільний текст та індекс ${i}</div>`);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.

// let i =0;
// while(i < 20){
//     document.write(`<h1>Довільний текст</h1>`);
//     i++;
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

// let i =0;
// while(i < 20){
//      document.write(`<h1>Довільний текст та індекс ${i}</h1>`);
//     i++;
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.

// let arrNum = [1, 4, 9, 16, 25, 36, 49, 64, 81, 100];
// for (let number of arrNum) {
//     console.log(number);
// }

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.

// let arrStr = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine', 'ten'];
// for (let string of arrStr) {
//     console.log(string);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.

// let arr = [1,'two', 'three', 4, true, false, 'seven', 'eight', 9, 'ten'];
// for (let arrElement of arr) {
//     console.log(arrElement);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи

// let arr = [1,'two', 'three', 4, true, false, 'seven', 'eight', 9, 'ten'];
// for (let arrElement of arr) {
//     if (typeof arrElement === "boolean"){
//         console.log(arrElement);
//     }
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи

// let arr = [1,'two', 'three', 4, true, false, 'seven', 'eight', 9, 'ten'];
// for (let arrElement of arr) {
//     if (typeof arrElement === "number"){
//         console.log(arrElement);
//     }
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи

// let arr = [1,'two', 'three', 4, true, false, 'seven', 'eight', 9, 'ten'];
// for (let arrElement of arr) {
//     if (typeof arrElement === "string"){
//         console.log(arrElement);
//     }
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.

// let arr = [];
// for (let i = 0; i < 10; i++) {
//     switch (i){
//         case 0: arr[i] = 1;
//             break;
//         case 1:arr[i] = 'two';
//             break;
//         case 2:arr[i] = 'three';
//             break;
//         case 3:arr[i] = 4;
//             break;
//         case 4:arr[i] = true;
//             break;
//         case 5:arr[i] = false;
//             break;
//         case 6:arr[i] = 'seven';
//             break;
//         case 7:arr[i] = 'eight';
//             break;
//         case 8:arr[i] = 9;
//             break;
//         case 9:arr[i] = 'ten';
//             break;
//     }
//     console.log(arr[i]);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 1; i <= 10; i++) {
//     document.write(`Крок ${i} <br>`);
//     console.log(`Крок ${i}`);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

// for (let i = 1; i <= 100; i++) {
//     document.write(`Крок ${i} <br>`);
//     console.log(`Крок ${i}`);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// let a = 1;
// for (let i = 0; i < 200; i+=2) {
//     document.write(`Крок ${a} <br>`);
//     console.log(`Крок ${a}`);
//     a++;
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

// for (let i = 1; i <= 100; i++) {
//     if (i%2 === 0){
//         document.write(`Крок ${i} <br>`);
//         console.log(`Крок ${i}`);
//     }
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// for (let i = 1; i <= 100; i++) {
//     if (i%2 === 1){
//         document.write(`Крок ${i} <br>`);
//         console.log(`Крок ${i}`);
//     }
// }

