// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time = Math.floor(Math.random() * 60);
// if (time <= 15) {
//     console.log(time + 'хв. - Перша чверть години.');
// } else if (time <= 30) {
//     console.log(time + 'хв. - Друга чверть години.');
// } else if (time <= 45) {
//     console.log(time + 'хв. - Третя чверть години.');
// } else {
//     console.log(time + 'хв. - Четверта чверть години.');
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = Math.floor(Math.random() * (32-1)+1);
// console.log(day);
// if (day <= 10) {
//     console.log(day + ' - Перша декада місяця.');
// } else if (day <= 20) {
//     console.log(day + ' - Друга декада місяця.');
// }else {
//     console.log(day + ' - Третя декада місяця.');
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
// let test = true;
// let output = !test ? 'Вірно' : 'Неправильно';
// console.log(output);
// test = false;
// output = !test ? 'Вірно' : 'Неправильно';
// console.log(output);
//

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = 1;
// let output = (a !== 0) ? 'Вірно' : 'Невірно';
// console.log(output);
// a = 0;
// output = (a !== 0) ? 'Вірно' : 'Невірно';
// console.log(output);
// a = -3;
// output = (a !== 0) ? 'Вірно' : 'Невірно';
// console.log(output);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let day = +prompt('Введіть порядковий номер дня тижня:');
// console.log(day);
// console.log('Що заплановано на цей день:')
// switch (day){
//     case 1:
//         console.log('Прогулятися в парку');
//         console.log('Нагодувати пса');
//         break;
//     case 2:
//         console.log('Відкрити книжку');
//         console.log('Почитати книжку');
//         console.log('Закрити книжку');
//         break;
//     case 3:
//         console.log('Сходити до музею');
//         break;
//     case 4:
//         console.log('Спати до обіду');
//         console.log('Випити кави');
//         console.log('Лягти спати');
//         break;
//     case 5:
//         console.log('Відпочивати і нічого не робити');
//         break;
//     case 6:
//         console.log('Вільний день');
//         break;
//     case 7:
//         console.log('Сходити в магазин');
//         console.log('Вигуляти пса');
//         break;
//     default:
//         console.log('Ви ввели некоректні дані, оновіть сторінку і спробуйте ще раз.')
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//
// let year = +prompt('Введіть рік:');
// if (year){
//     if (year % 4 === 0) {
//         console.log(year + ' рік високосний');
//     } else {
//         console.log(year + ' рік не є високосним');
//     }
// } else {console.log('Ви ввели некоректні дані, оновіть сторінку і спробуйте ще раз.')}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let a = 'ecmascript';
// let b = prompt('Яка «офіційна» назва JavaScript?');
// if (a === b.toLowerCase()){
//     alert('Правильно!');
// } else {alert('Не знаєте? ECMAScript!')}

