// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

// let a = +prompt('Введіть перше число:');
// let b = +prompt('Введіть друге число:');
//
// (a>b) ? console.log('Максимальне значення - '+a) :
//     ((a<b) ? console.log('Максимальне значення - '+b) :
//         ((a===b) ? console.log('Введені числа рівні') :
//             console.log('Ви ввели некоректну інформацію')));
//
// // АБО
//
// if(a>b){
//     console.log('Максимальне значення - '+a);
// } else if (a<b){
//     console.log('Максимальне значення - '+b);
// } else if (a===b) {
//     console.log('Введені числа рівні');
// } else {console.log('Ви ввели некоректну інформацію')}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//
// let k =+prompt('Введіть номер квартири:');
// if (k>=1 && k<=90){
//     if (k >= 1 && k <= 20) {
//         console.log('Перший під\'їзд');
//     } else if (k >= 21 && k <= 48) {
//         console.log('Другий під\'їзд');
//     } else if (k >= 49 && k <= 90) {
//         console.log('Третій під\'їзд');
//     }
// }else {
//     console.log('Невірний номер квартири, оновіть сторінку і спробуйте ще раз.')
// }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt('Введіть числове значення:');
// if (number === 10){
//     console.log('ВІРНО');
// }else{
//     console.log('НЕВІРНО');
// }

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

// let x = +prompt('Оберіть тип значення: 1-number, 2-string, 3-boolean, 4-object, 5-array');
// if (x===1){
//     x = +prompt('Введіть числове значення:');
// }else if (x===2){
//     x = prompt('Введіть рядок:');
// }else if (x===3){
//     x = prompt('Введіть значення: true або false');
//     if (x === 'true'){
//         x=!!x;
//         console.log(x);
//     } else if (x ==='false'){
//         x=!!!x;
//         console.log(x);
//     } else {
//         x = undefined;
//         console.log('Помилка. Було введено некоректне значення.');
//     }
// }else if (x===4){
//     x = {};
// }else if (x===5){
//     x = [];
// }else {
//     x = undefined;
//     console.log('Помилка. Введіть коректне значення.');
// }
// //console.log(typeof x);
// if (typeof x === "number"){
//     console.log(1);
// } else if (typeof x === 'string'){
//     console.log(2);
// } else if (typeof x === 'boolean'){
//     console.log(3);
// } else if (typeof x === 'object'){
//     console.log(-3);
// }

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let t = +prompt('Введіть температуру:');
// if (t >= 10 && t<=22){
//     console.log('Ми йдемо ВЧИТИСЯ');
// } else console.log('Сидимо вдома і вчимося ОНЛАЙН');

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let number = +prompt('Введіть число від 1 до 5:');
// switch (number){
//     case 1: console.log('Вітаємо, Ви виглали Автомобіль!');
//         break;
//     case 2: console.log('Вітаємо, Ви виглали Мотоцикл!');
//         break;
//     case 3: console.log('Вітаємо, Ви виглали Телефон!');
//         break;
//     case 4: console.log('Вітаємо, Ви виглали Квартиру!');
//         break;
//     case 5: console.log('Вітаємо, Ви виглали 1000 грн!');
//         break;
//     default: console.log('Число не вірне, Ви нічого не виграли :(');
// }
