// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
//
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3){
//     console.log('це великий масив, в якому 3 і більше елементи.');
// }else console.log('це маленький масив, в якому менше 3-х елементів.');

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//
// let a = +prompt('Введіть перше число:');
// let b = +prompt('Введіть друге число:');
// let c = +prompt('Введіть третє число:');
// let arr = [a,b,c];
// let m;
// if (a >= b && a >= c){
//     if (b > c){m = b}
//     else {m = c}
// }else if (b >= a && b >= c){
//     if (a > c){m = a}
//     else {m = c}
// }else if (c >= a && c >= b){
//     if (a > b){m = a}
//     else {m = b}
// }
// console.log('Середнє за значенням число '+m);
// if (arr[1] === m){
//     console.log('і воно знаходиться посередині, між двома іншими числами.');
// }else {console.log('але воно не знаходиться посередині, між двома іншими числами.')}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let a = +prompt('enter a:');
// let b = +prompt('enter b:');
// let result = (a + b < 4)? 'Мало':'Багато';
// console.log(result);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let num = Math.round(Math.random()*200-100);
// console.log(num);
// (num > 0)? console.log('Число є позитивним'): ((num < 0)? console.log('Число є негативним'):console.log('Це число 0'));
